Revit 2024 API
RailingPathCurveJoinOption Enumeration
 The join type of the railing path.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum RailingPathCurveJoinOption
Visual Basic
Public Enumeration RailingPathCurveJoinOption
Visual C++
public enum class RailingPathCurveJoinOption
Members
Member name | Description
ByType |  The rails will be joined according to the settings in the rail type.
ExtendRailsToMeet |  Extend rails to meet.
AddVerticalOrHorizontalSegments |  Add vertical or horizontal segments.
NoConnector |  No connector.
See Also
Autodesk.Revit.DB.Architecture Namespace